app/Controllers/DemoController.php

  public function deletedata()
  {
    $builder = $this->db->table('registration');

    $id = 4;


    //where clause
    // $builder->where(['id'=>$id]);

    $builder->delete(['id'=>$id]);
---
DELETE FROM `registration`
WHERE `id` = 4

  public function updatedata()
  {
    $builder = $this->db->table('registration');

    $update = ['username'=>'ashish',
              'email'=>'ashish@gmail.com',
              'mobile'=>'9479503986'];

      //where clause method with short code
    $builder->where(['id'=>2])->set($update)->update();
---
UPDATE `registration` SET `username` = 'ashish', `email` = 'ashish@gmail.com', `mobile` = '9479503986'
WHERE `id` = 2